# -*- coding: utf-8 -*-


# 'number' --------第幾卦
# 'title' ---------卦名
# 'body' ----------組合代號
# 'outGua' --------外卦(上)
# 'inGua' ---------內卦(下)
# 'rowType' --------屬性宮位五行
# 'sort' -----------第幾爻
# 'shiYao' ---------世爻
# 'innYao' ---------應爻
# 'guaBody' --------卦身
# 'naGia' ----------納甲
# 'naGiaType' --------納甲五行
# 'family' --------六親
# 'binary' --------卦(由上而下)

baGuaAllDict = [

{'number': '01', 'title': '乾', 'body': '天', 'outGua': '乾', 'inGua': '乾', 'rowType': '金', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '巳', 'naGia': ['甲子', '甲寅', '甲辰', '壬午', '壬申', '壬戌'], 'naGiaType': ['水', '木', '土', '火', '金', '土'], 'naInn': ['海中金', '大溪水', '覆燈火', '楊柳木', '劍鋒金', '大海水'], 'family': ['子孫', '妻財', '父母', '官鬼', '兄弟', '父母'], 'mode': 'X', 'symbol': '䷀', 'binary': '111111'},
{'number': '02', 'title': '坤', 'body': '地', 'outGua': '坤', 'inGua': '坤', 'rowType': '土', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '亥', 'naGia': ['乙未', '乙巳', '乙卯', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['土', '火', '木', '土', '水', '金'], 'naInn': ['砂中金', '覆燈火', '大溪水', '桑柘木', '大海水', '劍鋒金'], 'family': ['兄弟', '父母', '官鬼', '兄弟', '妻財', '子孫'], 'mode': 'X', 'symbol': '䷁', 'binary': '000000'},
{'number': '03', 'title': '水雷', 'body': '屯', 'outGua': '坎', 'inGua': '震', 'rowType': '水', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '未', 'naGia': ['庚子', '庚寅', '庚辰', '戊申', '戊戌', '戊子'], 'naGiaType': ['水', '木', '土', '金', '土', '水'], 'naInn': ['壁上土', '松柏木', '白蠟金', '大驛土', '平地木', '霹靂火'], 'family': ['兄弟', '子孫', '官鬼', '父母', '官鬼', '兄弟'], 'mode': '--', 'symbol': '䷂', 'binary': '100010'},
{'number': '04', 'title': '山水', 'body': '蒙', 'outGua': '艮', 'inGua': '坎', 'rowType': '火', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['戊寅', '戊辰', '戊午', '丙戌', '丙子', '丙寅'], 'naGiaType': ['木', '土', '火', '土', '水', '木'], 'naInn': ['城頭土', '大林木', '天上火', '屋上土', '澗下水', '爐中火'], 'family': ['父母', '子孫', '兄弟', '子孫', '官鬼', '父母'], 'mode': '--', 'symbol': '䷃', 'binary': '010001'},
{'number': '05', 'title': '水天', 'body': '需', 'outGua': '坎', 'inGua': '乾', 'rowType': '土', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['甲子', '甲寅', '甲辰', '戊申', '戊戌', '戊子'], 'naGiaType': ['水', '木', '土', '金', '土', '水'], 'naInn': ['海中金', '大溪水', '覆燈火', '大驛土', '平地木', '霹靂火'], 'family': ['妻財', '官鬼', '兄弟', '子孫', '兄弟', '妻財'], 'mode': '--', 'symbol': '䷄', 'binary': '111010'},
{'number': '06', 'title': '天水', 'body': '訟', 'outGua': '乾', 'inGua': '坎', 'rowType': '火', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['戊寅', '戊辰', '戊午', '壬午', '壬申', '壬戌'], 'naGiaType': ['木', '土', '火', '火', '金', '土'], 'naInn': ['城頭土', '大林木', '天上火', '楊柳木', '劍鋒金', '大海水'], 'family': ['父母', '子孫', '兄弟', '兄弟', '妻財', '子孫'], 'mode': '--', 'symbol': '䷅', 'binary': '010111'},
{'number': '07', 'title': '地水', 'body': '師', 'outGua': '坤', 'inGua': '坎', 'rowType': '水', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['戊寅', '戊辰', '戊午', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['木', '土', '火', '土', '水', '金'], 'naInn': ['城頭土', '大林木', '天上火', '桑柘木', '大海水', '劍鋒金'], 'family': ['子孫', '官鬼', '妻財', '官鬼', '兄弟', '父母'], 'mode': '--', 'symbol': '䷆', 'binary': '010000'},
{'number': '08', 'title': '水地', 'body': '比', 'outGua': '坎', 'inGua': '坤', 'rowType': '土', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['乙未', '乙巳', '乙卯', '戊申', '戊戌', '戊子'], 'naGiaType': ['土', '火', '木', '金', '土', '水'], 'naInn': ['砂中金', '覆燈火', '大溪水', '大驛土', '平地木', '霹靂火'], 'family': ['兄弟', '父母', '官鬼', '子孫', '兄弟', '妻財'], 'mode': '--', 'symbol': '䷇', 'binary': '000010'},
{'number': '09', 'title': '風天', 'body': '小畜', 'outGua': '巽', 'inGua': '乾', 'rowType': '木', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '子', 'naGia': ['甲子', '甲寅', '甲辰', '辛未', '辛巳', '辛卯'], 'naGiaType': ['水', '木', '土', '土', '火', '木'], 'naInn': ['海中金', '大溪水', '覆燈火', '路傍土', '白蠟金', '松柏木'], 'family': ['父母', '兄弟', '妻財', '妻財', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷈', 'binary': '111011'},
{'number': '10', 'title': '天澤', 'body': '履', 'outGua': '乾', 'inGua': '兌', 'rowType': '土', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '辰', 'naGia': ['丁巳', '丁卯', '丁丑', '壬午', '壬申', '壬戌'], 'naGiaType': ['火', '木', '土', '火', '金', '土'], 'naInn': ['沙中土', '爐中火', '澗下水', '楊柳木', '劍鋒金', '大海水'], 'family': ['父母', '官鬼', '兄弟', '父母', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷉', 'binary': '110111'},
{'number': '11', 'title': '地天', 'body': '泰', 'outGua': '坤', 'inGua': '乾', 'rowType': '土', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['甲子', '甲寅', '甲辰', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['水', '木', '土', '土', '水', '金'], 'naInn': ['海中金', '大溪水', '覆燈火', '桑柘木', '大海水', '劍鋒金'], 'family': ['妻財', '官鬼', '兄弟', '兄弟', '妻財', '子孫'], 'mode': 'O', 'symbol': '䷊', 'binary': '111000'},
{'number': '12', 'title': '天地', 'body': '否', 'outGua': '乾', 'inGua': '坤', 'rowType': '金', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['乙未', '乙巳', '乙卯', '壬午', '壬申', '壬戌'], 'naGiaType': ['土', '火', '木', '火', '金', '土'], 'naInn': ['砂中金', '覆燈火', '大溪水', '楊柳木', '劍鋒金', '大海水'], 'family': ['父母', '官鬼', '妻財', '官鬼', '兄弟', '父母'], 'mode': 'O', 'symbol': '䷋', 'binary': '000111'},
{'number': '13', 'title': '天火', 'body': '同人', 'outGua': '乾', 'inGua': '離', 'rowType': '火', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['己卯', '己丑', '己亥', '壬午', '壬申', '壬戌'], 'naGiaType': ['木', '土', '水', '火', '金', '土'], 'naInn': ['城頭土', '霹靂火', '平地木', '楊柳木', '劍鋒金', '大海水'], 'family': ['父母', '子孫', '官鬼', '兄弟', '妻財', '子孫'], 'mode': '--', 'symbol': '䷌', 'binary': '101111'},
{'number': '14', 'title': '火天', 'body': '大有', 'outGua': '離', 'inGua': '乾', 'rowType': '金', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['甲子', '甲寅', '甲辰', '己酉', '己未', '己巳'], 'naGiaType': ['水', '木', '土', '金', '土', '火'], 'naInn': ['海中金', '大溪水', '覆燈火', '大驛土', '天上火', '大林木'], 'family': ['子孫', '妻財', '父母', '兄弟', '父母', '官鬼'], 'mode': '--', 'symbol': '䷍', 'binary': '111101'},
{'number': '15', 'title': '地山', 'body': '謙', 'outGua': '坤', 'inGua': '艮', 'rowType': '金', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '戌', 'naGia': ['丙辰', '丙午', '丙申', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['土', '火', '金', '土', '水', '金'], 'naInn': ['沙中土', '天河水', '山下火', '桑柘木', '大海水', '劍鋒金'], 'family': ['父母', '官鬼', '兄弟', '父母', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷎', 'binary': '001000'},
{'number': '16', 'title': '雷地', 'body': '豫', 'outGua': '震', 'inGua': '坤', 'rowType': '木', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '午', 'naGia': ['乙未', '乙巳', '乙卯', '庚午', '庚申', '庚戌'], 'naGiaType': ['土', '火', '木', '火', '金', '土'], 'naInn': ['砂中金', '覆燈火', '大溪水', '路傍土', '石榴木', '釵釧金'], 'family': ['妻財', '子孫', '兄弟', '子孫', '官鬼', '妻財'], 'mode': 'O', 'symbol': '䷏', 'binary': '000100'},
{'number': '17', 'title': '澤雷', 'body': '隨', 'outGua': '兌', 'inGua': '震', 'rowType': '木', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['庚子', '庚寅', '庚辰', '丁亥', '丁酉', '丁未'], 'naGiaType': ['水', '木', '土', '水', '金', '土'], 'naInn': ['壁上土', '松柏木', '白蠟金', '屋上土', '山下火', '天河水'], 'family': ['父母', '兄弟', '妻財', '父母', '官鬼', '妻財'], 'mode': '--', 'symbol': '䷐', 'binary': '100110'},
{'number': '18', 'title': '山風', 'body': '蠱', 'outGua': '艮', 'inGua': '巽', 'rowType': '木', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['辛丑', '辛亥', '辛酉', '丙戌', '丙子', '丙寅'], 'naGiaType': ['土', '水', '金', '土', '水', '木'], 'naInn': ['壁上土', '釵釧金', '石榴木', '屋上土', '澗下水', '爐中火'], 'family': ['妻財', '父母', '官鬼', '妻財', '父母', '兄弟'], 'mode': '--', 'symbol': '䷑', 'binary': '011001'},
{'number': '19', 'title': '地澤', 'body': '臨', 'outGua': '坤', 'inGua': '兌', 'rowType': '土', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '丑', 'naGia': ['丁巳', '丁卯', '丁丑', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['火', '木', '土', '土', '水', '金'], 'naInn': ['沙中土', '爐中火', '澗下水', '桑柘木', '大海水', '劍鋒金'], 'family': ['父母', '官鬼', '兄弟', '兄弟', '妻財', '子孫'], 'mode': '--', 'symbol': '䷒', 'binary': '110000'},
{'number': '20', 'title': '風地', 'body': '觀', 'outGua': '巽', 'inGua': '坤', 'rowType': '金', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['乙未', '乙巳', '乙卯', '辛未', '辛巳', '辛卯'], 'naGiaType': ['土', '火', '木', '土', '火', '木'], 'naInn': ['砂中金', '覆燈火', '大溪水', '路傍土', '白蠟金', '松柏木'], 'family': ['父母', '官鬼', '妻財', '父母', '官鬼', '妻財'], 'mode': '--', 'symbol': '䷓', 'binary': '000011'},
{'number': '21', 'title': '火雷', 'body': '噬嗑', 'outGua': '離', 'inGua': '震', 'rowType': '木', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '戌', 'naGia': ['庚子', '庚寅', '庚辰', '己酉', '己未', '己巳'], 'naGiaType': ['水', '木', '土', '金', '土', '火'], 'naInn': ['壁上土', '松柏木', '白蠟金', '大驛土', '天上火', '大林木'], 'family': ['父母', '兄弟', '妻財', '官鬼', '妻財', '子孫'], 'mode': '--', 'symbol': '䷔', 'binary': '100101'},
{'number': '22', 'title': '山火', 'body': '賁', 'outGua': '艮', 'inGua': '離', 'rowType': '土', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '子', 'naGia': ['己卯', '己丑', '己亥', '丙戌', '丙子', '丙寅'], 'naGiaType': ['木', '土', '水', '土', '水', '木'], 'naInn': ['城頭土', '霹靂火', '平地木', '屋上土', '澗下水', '爐中火'], 'family': ['官鬼', '兄弟', '妻財', '兄弟', '妻財', '官鬼'], 'mode': 'O', 'symbol': '䷕', 'binary': '101001'},
{'number': '23', 'title': '山地', 'body': '剝', 'outGua': '艮', 'inGua': '坤', 'rowType': '金', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '戌', 'naGia': ['乙未', '乙巳', '乙卯', '丙戌', '丙子', '丙寅'], 'naGiaType': ['土', '火', '木', '土', '水', '木'], 'naInn': ['砂中金', '覆燈火', '大溪水', '屋上土', '澗下水', '爐中火'], 'family': ['父母', '官鬼', '妻財', '父母', '子孫', '妻財'], 'mode': '--', 'symbol': '䷖', 'binary': '000001'},
{'number': '24', 'title': '地雷', 'body': '復', 'outGua': '坤', 'inGua': '震', 'rowType': '土', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '子', 'naGia': ['庚子', '庚寅', '庚辰', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['水', '木', '土', '土', '水', '金'], 'naInn': ['壁上土', '松柏木', '白蠟金', '桑柘木', '大海水', '劍鋒金'], 'family': ['妻財', '官鬼', '兄弟', '兄弟', '妻財', '子孫'], 'mode': 'O', 'symbol': '䷗', 'binary': '100000'},
{'number': '25', 'title': '天雷', 'body': '無妄', 'outGua': '乾', 'inGua': '震', 'rowType': '木', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['庚子', '庚寅', '庚辰', '壬午', '壬申', '壬戌'], 'naGiaType': ['水', '木', '土', '火', '金', '土'], 'naInn': ['壁上土', '松柏木', '白蠟金', '楊柳木', '劍鋒金', '大海水'], 'family': ['父母', '兄弟', '妻財', '子孫', '官鬼', '妻財'], 'mode': 'X', 'symbol': '䷘', 'binary': '100111'},
{'number': '26', 'title': '山天', 'body': '大畜', 'outGua': '艮', 'inGua': '乾', 'rowType': '土', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '丑', 'naGia': ['甲子', '甲寅', '甲辰', '丙戌', '丙子', '丙寅'], 'naGiaType': ['水', '木', '土', '土', '水', '木'], 'naInn': ['海中金', '大溪水', '覆燈火', '屋上土', '澗下水', '爐中火'], 'family': ['妻財', '官鬼', '兄弟', '兄弟', '妻財', '官鬼'], 'mode': '--', 'symbol': '䷙', 'binary': '111001'},
{'number': '27', 'title': '山雷', 'body': '頤', 'outGua': '艮', 'inGua': '震', 'rowType': '木', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['庚子', '庚寅', '庚辰', '丙戌', '丙子', '丙寅'], 'naGiaType': ['水', '木', '土', '土', '水', '木'], 'naInn': ['壁上土', '松柏木', '白蠟金', '屋上土', '澗下水', '爐中火'], 'family': ['父母', '兄弟', '妻財', '妻財', '父母', '兄弟'], 'mode': '--', 'symbol': '䷚', 'binary': '100001'},
{'number': '28', 'title': '澤風', 'body': '大過', 'outGua': '兌', 'inGua': '巽', 'rowType': '木', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['辛丑', '辛亥', '辛酉', '丁亥', '丁酉', '丁未'], 'naGiaType': ['土', '水', '金', '水', '金', '土'], 'naInn': ['壁上土', '釵釧金', '石榴木', '屋上土', '山下火', '天河水'], 'family': ['妻財', '父母', '官鬼', '父母', '官鬼', '妻財'], 'mode': '--', 'symbol': '䷛', 'binary': '011110'},
{'number': '29', 'title': '坎', 'body': '水', 'outGua': '坎', 'inGua': '坎', 'rowType': '水', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '亥', 'naGia': ['戊寅', '戊辰', '戊午', '戊申', '戊戌', '戊子'], 'naGiaType': ['木', '土', '火', '金', '土', '水'], 'naInn': ['城頭土', '大林木', '天上火', '大驛土', '平地木', '霹靂火'], 'family': ['子孫', '官鬼', '妻財', '父母', '官鬼', '兄弟'], 'mode': 'X', 'symbol': '䷜', 'binary': '010010'},
{'number': '30', 'title': '離', 'body': '火', 'outGua': '離', 'inGua': '離', 'rowType': '火', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '巳', 'naGia': ['己卯', '己丑', '己亥', '己酉', '己未', '己巳'], 'naGiaType': ['木', '土', '水', '金', '土', '火'], 'naInn': ['城頭土', '霹靂火', '平地木', '大驛土', '天上火', '大林木'], 'family': ['父母', '子孫', '官鬼', '妻財', '子孫', '兄弟'], 'mode': 'X', 'symbol': '䷝', 'binary': '101101'},
{'number': '31', 'title': '澤山', 'body': '咸', 'outGua': '兌', 'inGua': '艮', 'rowType': '金', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['丙辰', '丙午', '丙申', '丁亥', '丁酉', '丁未'], 'naGiaType': ['土', '火', '金', '水', '金', '土'], 'naInn': ['沙中土', '天河水', '山下火', '屋上土', '山下火', '天河水'], 'family': ['父母', '官鬼', '兄弟', '子孫', '兄弟', '父母'], 'mode': '--', 'symbol': '䷞', 'binary': '001110'},
{'number': '32', 'title': '雷風', 'body': '恆', 'outGua': '震', 'inGua': '巽', 'rowType': '木', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['辛丑', '辛亥', '辛酉', '庚午', '庚申', '庚戌'], 'naGiaType': ['土', '水', '金', '火', '金', '土'], 'naInn': ['壁上土', '釵釧金', '石榴木', '路傍土', '石榴木', '釵釧金'], 'family': ['妻財', '父母', '官鬼', '子孫', '官鬼', '妻財'], 'mode': '--', 'symbol': '䷟', 'binary': '011100'},
{'number': '33', 'title': '天山', 'body': '遯', 'outGua': '乾', 'inGua': '艮', 'rowType': '金', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '未', 'naGia': ['丙辰', '丙午', '丙申', '壬午', '壬申', '壬戌'], 'naGiaType': ['土', '火', '金', '火', '金', '土'], 'naInn': ['沙中土', '天河水', '山下火', '楊柳木', '劍鋒金', '大海水'], 'family': ['父母', '官鬼', '兄弟', '官鬼', '兄弟', '父母'], 'mode': '--', 'symbol': '䷠', 'binary': '001111'},
{'number': '34', 'title': '雷天', 'body': '大壯', 'outGua': '震', 'inGua': '乾', 'rowType': '土', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['甲子', '甲寅', '甲辰', '庚午', '庚申', '庚戌'], 'naGiaType': ['水', '木', '土', '火', '金', '土'], 'naInn': ['海中金', '大溪水', '覆燈火', '路傍土', '石榴木', '釵釧金'], 'family': ['妻財', '官鬼', '兄弟', '父母', '子孫', '兄弟'], 'mode': 'X', 'symbol': '䷡', 'binary': '111100'},
{'number': '35', 'title': '火地', 'body': '晉', 'outGua': '離', 'inGua': '坤', 'rowType': '金', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['乙未', '乙巳', '乙卯', '己酉', '己未', '己巳'], 'naGiaType': ['土', '火', '木', '金', '土', '火'], 'naInn': ['砂中金', '覆燈火', '大溪水', '大驛土', '天上火', '大林木'], 'family': ['父母', '官鬼', '妻財', '兄弟', '父母', '官鬼'], 'mode': '--', 'symbol': '䷢', 'binary': '000101'},
{'number': '36', 'title': '地火', 'body': '明夷', 'outGua': '坤', 'inGua': '離', 'rowType': '水', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['己卯', '己丑', '己亥', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['木', '土', '水', '土', '水', '金'], 'naInn': ['城頭土', '霹靂火', '平地木', '桑柘木', '大海水', '劍鋒金'], 'family': ['子孫', '官鬼', '兄弟', '官鬼', '兄弟', '父母'], 'mode': '--', 'symbol': '䷣', 'binary': '101000'},
{'number': '37', 'title': '風火', 'body': '家人', 'outGua': '巽', 'inGua': '離', 'rowType': '木', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '未', 'naGia': ['己卯', '己丑', '己亥', '辛未', '辛巳', '辛卯'], 'naGiaType': ['木', '土', '水', '土', '火', '木'], 'naInn': ['城頭土', '霹靂火', '平地木', '路傍土', '白蠟金', '松柏木'], 'family': ['兄弟', '妻財', '父母', '妻財', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷤', 'binary': '101011'},
{'number': '38', 'title': '火澤', 'body': '睽', 'outGua': '離', 'inGua': '兌', 'rowType': '土', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['丁巳', '丁卯', '丁丑', '己酉', '己未', '己巳'], 'naGiaType': ['火', '木', '土', '金', '土', '火'], 'naInn': ['沙中土', '爐中火', '澗下水', '大驛土', '天上火', '大林木'], 'family': ['父母', '官鬼', '兄弟', '子孫', '兄弟', '父母'], 'mode': '--', 'symbol': '䷥', 'binary': '110101'},
{'number': '39', 'title': '水山', 'body': '蹇', 'outGua': '坎', 'inGua': '艮', 'rowType': '金', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['丙辰', '丙午', '丙申', '戊申', '戊戌', '戊子'], 'naGiaType': ['土', '火', '金', '金', '土', '水'], 'naInn': ['沙中土', '天河水', '山下火', '大驛土', '平地木', '霹靂火'], 'family': ['父母', '官鬼', '兄弟', '兄弟', '父母', '子孫'], 'mode': '--', 'symbol': '䷦', 'binary': '001010'},
{'number': '40', 'title': '雷水', 'body': '解', 'outGua': '震', 'inGua': '坎', 'rowType': '木', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '丑', 'naGia': ['戊寅', '戊辰', '戊午', '庚午', '庚申', '庚戌'], 'naGiaType': ['木', '土', '火', '火', '金', '土'], 'naInn': ['城頭土', '大林木', '天上火', '路傍土', '石榴木', '釵釧金'], 'family': ['兄弟', '妻財', '子孫', '子孫', '官鬼', '妻財'], 'mode': '--', 'symbol': '䷧', 'binary': '010100'},
{'number': '41', 'title': '山澤', 'body': '損', 'outGua': '艮', 'inGua': '兌', 'rowType': '土', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['丁巳', '丁卯', '丁丑', '丙戌', '丙子', '丙寅'], 'naGiaType': ['火', '木', '土', '土', '水', '木'], 'naInn': ['沙中土', '爐中火', '澗下水', '屋上土', '澗下水', '爐中火'], 'family': ['父母', '官鬼', '兄弟', '兄弟', '妻財', '官鬼'], 'mode': '--', 'symbol': '䷨', 'binary': '110001'},
{'number': '42', 'title': '風雷', 'body': '益', 'outGua': '巽', 'inGua': '震', 'rowType': '木', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['庚子', '庚寅', '庚辰', '辛未', '辛巳', '辛卯'], 'naGiaType': ['水', '木', '土', '土', '火', '木'], 'naInn': ['壁上土', '松柏木', '白蠟金', '路傍土', '白蠟金', '松柏木'], 'family': ['父母', '兄弟', '妻財', '妻財', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷩', 'binary': '100011'},
{'number': '43', 'title': '澤天', 'body': '夬', 'outGua': '兌', 'inGua': '乾', 'rowType': '土', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '辰', 'naGia': ['甲子', '甲寅', '甲辰', '丁亥', '丁酉', '丁未'], 'naGiaType': ['水', '木', '土', '水', '金', '土'], 'naInn': ['海中金', '大溪水', '覆燈火', '屋上土', '山下火', '天河水'], 'family': ['妻財', '官鬼', '兄弟', '妻財', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷪', 'binary': '111110'},
{'number': '44', 'title': '天風', 'body': '姤', 'outGua': '乾', 'inGua': '巽', 'rowType': '金', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '午', 'naGia': ['辛丑', '辛亥', '辛酉', '壬午', '壬申', '壬戌'], 'naGiaType': ['土', '水', '金', '火', '金', '土'], 'naInn': ['壁上土', '釵釧金', '石榴木', '楊柳木', '劍鋒金', '大海水'], 'family': ['父母', '子孫', '兄弟', '官鬼', '兄弟', '父母'], 'mode': '--', 'symbol': '䷫', 'binary': '011111'},
{'number': '45', 'title': '澤地', 'body': '萃', 'outGua': '兌', 'inGua': '坤', 'rowType': '金', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '未', 'naGia': ['乙未', '乙巳', '乙卯', '丁亥', '丁酉', '丁未'], 'naGiaType': ['土', '火', '木', '水', '金', '土'], 'naInn': ['砂中金', '覆燈火', '大溪水', '屋上土', '山下火', '天河水'], 'family': ['父母', '官鬼', '妻財', '子孫', '兄弟', '父母'], 'mode': '--', 'symbol': '䷬', 'binary': '000110'},
{'number': '46', 'title': '地風', 'body': '升', 'outGua': '坤', 'inGua': '巽', 'rowType': '木', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['辛丑', '辛亥', '辛酉', '癸丑', '癸亥', '癸酉'], 'naGiaType': ['土', '水', '金', '土', '水', '金'], 'naInn': ['壁上土', '釵釧金', '石榴木', '桑柘木', '大海水', '劍鋒金'], 'family': ['妻財', '父母', '官鬼', '妻財', '父母', '官鬼'], 'mode': '--', 'symbol': '䷭', 'binary': '011000'},
{'number': '47', 'title': '澤水', 'body': '困', 'outGua': '兌', 'inGua': '坎', 'rowType': '金', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '午', 'naGia': ['戊寅', '戊辰', '戊午', '丁亥', '丁酉', '丁未'], 'naGiaType': ['木', '土', '火', '水', '金', '土'], 'naInn': ['城頭土', '大林木', '天上火', '屋上土', '山下火', '天河水'], 'family': ['妻財', '父母', '官鬼', '子孫', '兄弟', '父母'], 'mode': 'O', 'symbol': '䷮', 'binary': '010110'},
{'number': '48', 'title': '水風', 'body': '井', 'outGua': '坎', 'inGua': '巽', 'rowType': '木', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '辰', 'naGia': ['辛丑', '辛亥', '辛酉', '戊申', '戊戌', '戊子'], 'naGiaType': ['土', '水', '金', '金', '土', '水'], 'naInn': ['壁上土', '釵釧金', '石榴木', '大驛土', '平地木', '霹靂火'], 'family': ['妻財', '父母', '官鬼', '官鬼', '妻財', '父母'], 'mode': '--', 'symbol': '䷯', 'binary': '011010'},
{'number': '49', 'title': '澤火', 'body': '革', 'outGua': '兌', 'inGua': '離', 'rowType': '水', 'sort': '四爻', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['己卯', '己丑', '己亥', '丁亥', '丁酉', '丁未'], 'naGiaType': ['木', '土', '水', '水', '金', '土'], 'naInn': ['城頭土', '霹靂火', '平地木', '屋上土', '山下火', '天河水'], 'family': ['子孫', '官鬼', '兄弟', '兄弟', '父母', '官鬼'], 'mode': '--', 'symbol': '䷰', 'binary': '101110'},
{'number': '50', 'title': '火風', 'body': '鼎', 'outGua': '離', 'inGua': '巽', 'rowType': '火', 'sort': '二爻', 'shiYao': '2', 'innYao': '5', 'guaBody': '丑', 'naGia': ['辛丑', '辛亥', '辛酉', '己酉', '己未', '己巳'], 'naGiaType': ['土', '水', '金', '金', '土', '火'], 'naInn': ['壁上土', '釵釧金', '石榴木', '大驛土', '天上火', '大林木'], 'family': ['子孫', '官鬼', '妻財', '妻財', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷱', 'binary': '011101'},
{'number': '51', 'title': '震', 'body': '雷', 'outGua': '震', 'inGua': '震', 'rowType': '木', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '亥', 'naGia': ['庚子', '庚寅', '庚辰', '庚午', '庚申', '庚戌'], 'naGiaType': ['水', '木', '土', '火', '金', '土'], 'naInn': ['壁上土', '松柏木', '白蠟金', '路傍土', '石榴木', '釵釧金'], 'family': ['父母', '兄弟', '妻財', '子孫', '官鬼', '妻財'], 'mode': 'X', 'symbol': '䷲', 'binary': '100100'},
{'number': '52', 'title': '艮', 'body': '山', 'outGua': '艮', 'inGua': '艮', 'rowType': '土', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '巳', 'naGia': ['丙辰', '丙午', '丙申', '丙戌', '丙子', '丙寅'], 'naGiaType': ['土', '火', '金', '土', '水', '木'], 'naInn': ['沙中土', '天河水', '山下火', '屋上土', '澗下水', '爐中火'], 'family': ['兄弟', '父母', '子孫', '兄弟', '妻財', '官鬼'], 'mode': 'X', 'symbol': '䷳', 'binary': '001001'},
{'number': '53', 'title': '風山', 'body': '漸', 'outGua': '巽', 'inGua': '艮', 'rowType': '土', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['丙辰', '丙午', '丙申', '辛未', '辛巳', '辛卯'], 'naGiaType': ['土', '火', '金', '土', '火', '木'], 'naInn': ['沙中土', '天河水', '山下火', '路傍土', '白蠟金', '松柏木'], 'family': ['兄弟', '父母', '子孫', '兄弟', '父母', '官鬼'], 'mode': '--', 'symbol': '䷴', 'binary': '001011'},
{'number': '54', 'title': '雷澤', 'body': '歸妹', 'outGua': '震', 'inGua': '兌', 'rowType': '金', 'sort': '歸魂', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['丁巳', '丁卯', '丁丑', '庚午', '庚申', '庚戌'], 'naGiaType': ['火', '木', '土', '火', '金', '土'], 'naInn': ['沙中土', '爐中火', '澗下水', '路傍土', '石榴木', '釵釧金'], 'family': ['官鬼', '妻財', '父母', '官鬼', '兄弟', '父母'], 'mode': '--', 'symbol': '䷵', 'binary': '110100'},
{'number': '55', 'title': '雷火', 'body': '豐', 'outGua': '震', 'inGua': '離', 'rowType': '水', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '戌', 'naGia': ['己卯', '己丑', '己亥', '庚午', '庚申', '庚戌'], 'naGiaType': ['木', '土', '水', '火', '金', '土'], 'naInn': ['城頭土', '霹靂火', '平地木', '路傍土', '石榴木', '釵釧金'], 'family': ['子孫', '官鬼', '兄弟', '妻財', '父母', '官鬼'], 'mode': '--', 'symbol': '䷶', 'binary': '101100'},
{'number': '56', 'title': '火山', 'body': '旅', 'outGua': '離', 'inGua': '艮', 'rowType': '火', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '午', 'naGia': ['丙辰', '丙午', '丙申', '己酉', '己未', '己巳'], 'naGiaType': ['土', '火', '金', '金', '土', '火'], 'naInn': ['沙中土', '天河水', '山下火', '大驛土', '天上火', '大林木'], 'family': ['子孫', '兄弟', '妻財', '妻財', '子孫', '兄弟'], 'mode': 'O', 'symbol': '䷷', 'binary': '001101'},
{'number': '57', 'title': '巽', 'body': '風', 'outGua': '巽', 'inGua': '巽', 'rowType': '木', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '巳', 'naGia': ['辛丑', '辛亥', '辛酉', '辛未', '辛巳', '辛卯'], 'naGiaType': ['土', '水', '金', '土', '火', '木'], 'naInn': ['壁上土', '釵釧金', '石榴木', '路傍土', '白蠟金', '松柏木'], 'family': ['妻財', '父母', '官鬼', '妻財', '子孫', '兄弟'], 'mode': 'X', 'symbol': '䷸', 'binary': '011011'},
{'number': '58', 'title': '兌', 'body': '澤', 'outGua': '兌', 'inGua': '兌', 'rowType': '金', 'sort': '純卦', 'shiYao': '6', 'innYao': '3', 'guaBody': '亥', 'naGia': ['丁巳', '丁卯', '丁丑', '丁亥', '丁酉', '丁未'], 'naGiaType': ['火', '木', '土', '水', '金', '土'], 'naInn': ['沙中土', '爐中火', '澗下水', '屋上土', '山下火', '天河水'], 'family': ['官鬼', '妻財', '父母', '子孫', '兄弟', '父母'], 'mode': 'X', 'symbol': '䷹', 'binary': '110110'},
{'number': '59', 'title': '風水', 'body': '渙', 'outGua': '巽', 'inGua': '坎', 'rowType': '火', 'sort': '五爻', 'shiYao': '5', 'innYao': '2', 'guaBody': '辰', 'naGia': ['戊寅', '戊辰', '戊午', '辛未', '辛巳', '辛卯'], 'naGiaType': ['木', '土', '火', '土', '火', '木'], 'naInn': ['城頭土', '大林木', '天上火', '路傍土', '白蠟金', '松柏木'], 'family': ['父母', '子孫', '兄弟', '子孫', '兄弟', '父母'], 'mode': '--', 'symbol': '䷺', 'binary': '010011'},
{'number': '60', 'title': '水澤', 'body': '節', 'outGua': '坎', 'inGua': '兌', 'rowType': '水', 'sort': '初爻', 'shiYao': '1', 'innYao': '4', 'guaBody': '子', 'naGia': ['丁巳', '丁卯', '丁丑', '戊申', '戊戌', '戊子'], 'naGiaType': ['火', '木', '土', '金', '土', '水'], 'naInn': ['沙中土', '爐中火', '澗下水', '大驛土', '平地木', '霹靂火'], 'family': ['妻財', '子孫', '官鬼', '父母', '官鬼', '兄弟'], 'mode': 'O', 'symbol': '䷻', 'binary': '110010'},
{'number': '61', 'title': '風澤', 'body': '中孚', 'outGua': '巽', 'inGua': '兌', 'rowType': '土', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '酉', 'naGia': ['丁巳', '丁卯', '丁丑', '辛未', '辛巳', '辛卯'], 'naGiaType': ['火', '木', '土', '土', '火', '木'], 'naInn': ['沙中土', '爐中火', '澗下水', '路傍土', '白蠟金', '松柏木'], 'family': ['父母', '官鬼', '兄弟', '兄弟', '父母', '官鬼'], 'mode': '--', 'symbol': '䷼', 'binary': '110011'},
{'number': '62', 'title': '雷山', 'body': '小過', 'outGua': '震', 'inGua': '艮', 'rowType': '金', 'sort': '游魂', 'shiYao': '4', 'innYao': '1', 'guaBody': '卯', 'naGia': ['丙辰', '丙午', '丙申', '庚午', '庚申', '庚戌'], 'naGiaType': ['土', '火', '金', '火', '金', '土'], 'naInn': ['沙中土', '天河水', '山下火', '路傍土', '石榴木', '釵釧金'], 'family': ['父母', '官鬼', '兄弟', '官鬼', '兄弟', '父母'], 'mode': '--', 'symbol': '䷽', 'binary': '001100'},
{'number': '63', 'title': '水火', 'body': '既濟', 'outGua': '坎', 'inGua': '離', 'rowType': '水', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '寅', 'naGia': ['己卯', '己丑', '己亥', '戊申', '戊戌', '戊子'], 'naGiaType': ['木', '土', '水', '金', '土', '水'], 'naInn': ['城頭土', '霹靂火', '平地木', '大驛土', '平地木', '霹靂火'], 'family': ['子孫', '官鬼', '兄弟', '父母', '官鬼', '兄弟'], 'mode': '--', 'symbol': '䷾', 'binary': '101010'},
{'number': '64', 'title': '火水', 'body': '未濟', 'outGua': '離', 'inGua': '坎', 'rowType': '火', 'sort': '三爻', 'shiYao': '3', 'innYao': '6', 'guaBody': '申', 'naGia': ['戊寅', '戊辰', '戊午', '己酉', '己未', '己巳'], 'naGiaType': ['木', '土', '火', '金', '土', '火'], 'naInn': ['城頭土', '大林木', '天上火', '大驛土', '天上火', '大林木'], 'family': ['父母', '子孫', '兄弟', '妻財', '子孫', '兄弟'], 'mode': '--', 'symbol': '䷿', 'binary': '010101'},
]

if __name__ == '__main__':
	print("\n\n\n\n\n")
	for e in baGuaAllDict:
		print( "%s%s" %  (e,","))
	print( baGuaAllDict[0].keys() )




# deeZhi_dict = {
# # 象義：代表軍人、盜賊、流動性職業、好淫亂、人無主見、也主機密檔案。子水為忌克主腿痛，腳痛，破財。家住近水,有水災之人,有外傷骨折之人，首領、名人、智慧、聰明、豪奢、陰私、奸邪、闇昧、色慾、悲泣、丟失。
#     "地支子" :{
#         "show_type":"地支",
#         "index" : ["子"],
#         "subTitle" : "首領,名人,智慧,聰明,豪奢,陰私,奸邪,暗昧,色慾,悲泣,丟失",

#         "衝合" : "子午相衝,子丑相合",
#         "人物" : "女人,兒童,藝人,書畫者,盜賊,好色之人,旅遊之人,科學研究者,文化事業,化學行業,秘書,會計,水上工作者,運輸者,從事液體物質經營者,黑衣人,混血人,淫亂人",
#         "形態" : "面黑或眼大,大頭,身體圓潤,皮膚光滑",
#         "性情" : "可圓可方,處事圓滑,上善若水,聰明吉祥",
#         "人體" : "腎,膀胱,精神,血液,血管,大腦,卵子,腳趾,生殖系統,內分泌系統,精液,經血",
#         "動物" : "老鼠,田鼠,鳥類,蝙蝠,魚類,喜水動物",
#         "植物" : "蔬菜,水果,水草,蘆葦,荷花,稜角,水稻等一切水中生長的植物",
#         "靜物" : "書畫,樂器,珠寶玉器,墨水,顏料,首飾,筐,籠,繩索,湯匙,碗,杯,桶,瓶,盆,甕,液體物品,絲綢,布匹,大豆,茶,糖,鹽,飲品,車,船,交通工具",
#         "地理" : "江,河,湖,海,塘,溝渠,安河,道路,水管,廁所,廚房,水池,噴泉,水廠,飲料廠,化工廠",
#         "方位" : "正北",
#         "天時" : "雨,雪,霧,霜",
#         "色彩" : "黑色",
#         "肖像" : "強時為高黑,長臉,弱時為矮胖,國字臉",
#         "環境" : "為喜神時表示為清澈的江河,水井,水地,水缸等,為忌神時類象為污臭之水,如臭水溝,下水道,臭水塘等",
#         "人物" : "為喜神時類象為少男,軍警,公務員等吉利人物,為忌神時類象為盜賊,土匪,少年犯等不吉利人物",
#         "人體" : "不論喜忌均可類象為排泄系統,生殖系統,體液,膀胱,尿道,陰部,精液,月經,耳朵等",
#         "疾病" : "類象為高血壓,腎結石,性病,早泄等",
#         "吉凶" : "喜則表示聰明,吉祥,忌時表示淫亂,血光之災,污穢不吉之事"
#     },
     
# # 象義：代表忠厚老實、性情倔強、醜陋、正直、賢良、福德、職稱、難堪、田宅、房屋、財產、院落、爭鬥、詛咒、冤仇、告狀、官司、舉薦、金融、包含金融相關職業。
#     "地支丑" :{
#         "show_type":"地支",
#         "index" : ["丑"],
#         "subEtc" : "[陰土]",
#         "subTitle" : "忠厚,正直,賢良,福德,職稱,難堪,丑陋,田宅,房屋,財產,院落,爭鬥,詛咒,冤仇,告狀,官司,舉薦",

#         "衝合" : "丑未相衝,丑子相合",
#         "人物" : "領導,房地產經紀,種植者,採礦者,長者,父母,僧人,基督徒,教徒,個子矮,瘸子,駝背",
#         "形態" : "丑陋,矮子,瘸子,駝背,大肚子,禿發人,眼睛有毛病者,鼻子有毛病者,嘴有毛病者,詛咒的人,受冤屈的人,精神病,言語甕裡甕氣",
#         "性情" : "忠厚,賢良,說話不好聽,愛罵人,告狀",
#         "人體" : "脾,胃,腸,血管,精神,大腦,神經,足,棉布,眼睛,子宮,陰莖,結腸,脾臟,肛門,嘴脣",
#         "動物" : "牛,馬,驢,騾,羊,豬,龜,鱉,蜈蚣,鴨,鵝等",
#         "植物" : "蔬菜,瓜果,桑樹,地瓜,土豆,山藥,植物的根",
#         "靜物" : "車,首飾,珠寶,櫃子,尺子,食物,枯物,鎖,鑰匙,鞋子",
#         "地理" : "桑園,河流,橋梁,宮殿,禮堂,寺廟,倉庫,田園,菜地,監獄,死屍,墳墓",
#         "方位" : "北偏東",
#         "天時" : "陰天,多雲,雨天",
#         "色彩" : "黃色",
#         "肖像" : "強時類象為臉大,皮膚好,弱時類象為矮丑,皮膚粗糙",
#         "環境" : "為喜神時類象為菜園,桑園,橋梁,宮殿,禮堂等,為忌時為陰濕之地,污濁之地,墳地",
#         "人物" : "為喜時類象為貴人,師長,神佛,父,為忌時類象為老婦,丑婦,死屍等",
#         "人體" : "不論喜忌均可類象為脾臟,肚腹,子宮,陰莖,嘴脣",
#         "動物" : "牛,騾子",
#         "疾病" : "類象為感冒傷風,糖尿病",
#         "吉凶" : "喜則升官,得獎,走好運等吉慶之事,忌則表示口舌,疾病,被嚇等不吉利之事"
#     },

# # 象義：文書、財帛、官貴、主清高、主服裝、文憑、高大、高貴、生髮、生機、才華、代表有文化的老人、開始、發揮、實際、變化、進行、木器、文章、文藝、藝術、教育。
#     "地支寅" :{
#         "show_type":"地支",
#         "index" : ["寅"],
#         "subEtc" : "[陽木]",
#         "subTitle" : "開始,發揮,實際,變化,進行,木器,文章,文藝,藝術,教育,管理,婚姻,喜慶",

#         "衝合" : "寅申相衝,寅亥相合",
#         "人物" : "官員,領導,管理員,朋友,家長,丈夫,女婿,文化人,醫生,藥品產銷者,醫療器械產銷者,教徒,木匠,藝人,教育工作者,採礦者",
#         "形態" : "方臉,面色青白,額頭大,有鬍鬚,身材魁梧",
#         "性情" : "仁慈,虛偽,偽裝,易怒",
#         "人體" : "肝,膽,發,口,眼,筋,手,指甲,腿",
#         "動物" : "老虎,豹子,貓,狐狸,狗,啄木鳥",
#         "植物" : "高大樹木,竹子,果樹,花木等",
#         "靜物" : "橫梁,柱子,電桿,屏風,保健,爐灶,車後輪,香爐,盆,桌椅,橋梁,竹製品,蔬菜,食品,書籍,文件,襪子,鞋子,衣服,虎畫,毛畫,山水畫"
#     },
     
# # 象義：代表車船、買賣交易、資訊、婚姻媒介、公吏、司機（飛機、車、船）、代表四肢、逃亡、振動、搖擺、急促、消耗、失盜、流動、藝術、文化、歡樂、祥和。
#     "地支卯" :{
#         "show_type":"地支",
#         "index" : ["卯"],
#         "subEtc" : "[陰木]",
#         "subTitle" : "逃往,振動,搖擺,急促,消耗,失盜,流動,藝術,文化,歡樂,祥和",

#         "衝合" : "卯酉相衝,卯戌相合",
#         "形態" : "面長,臉色青白,大腦門,身體細長",
#         "性情" : "衝動,直白,說話不拐彎抹角,性急",
#         "人體" : "十指,毛髮,肝",
#         "動物" : "兔子,松鼠,羊,鹿",
#         "植物" : "花草,竹子,植物的莖,農作物",
#         "方位" : "東方",
#         "天時" : "風",
#         "色彩" : "綠",
#         "肖像" : "強時類象為身高中等,臉較園,雙眼皮,弱時類象為個子不高,臉青黑,眉毛稀少,臉長",
#         "環境" : "為喜時類象為道路,門窗,小船,為忌時類象為破船,被毀的樹木,被棄的花木",
#         "人物" : "為喜時類象為兄弟,姑母,為忌時類象為老姑婆,丈母娘,小偷",
#         "人體" : "不論喜忌均可類象為肝,筋骨,肘,神經,體毛,十指,腋下",
#         "動物" : "兔子",
#         "吉凶" : "喜則出行吉利,車船平安,凶則車船遇險,犯電線桿,樹木等煞",
#         "疾病" : "肝腹水,腰椎突出,斷腿"
#     },     
     

#     "地支辰" :{
#         "show_type":"地支",
#         "index" : ["辰"],
#         "subEtc" : "[陽土]",
#         "subTitle" : "鬥爭,死喪,困難,牢獄,官司,遲滯,玩惡,堅硬,凶怪,打架,動搖,輩分,驚恐,焦慮,孕育,惡夢,自縊",

#         "衝合" : "辰戌相衝,辰酉相合",
#         "人物" : "黑社會,流氓,無賴,公檢法人員,軍人,安全工作者,捕獵者,殺人犯,病人,醫生,律師,寡婦,三狗者,將要死亡的人,孕婦,胖人",
#         "形態" : "圓臉,滿臉嚴肅,冷酷,色黃,多須",
#         "性情" : "心狠手辣,心情冷酷,思想頑固,邪惡多淫",
#         "人體" : "腸,胃,胸,乳,眼睛斜視,視物昏花,臀,脾,作踐,項背,坐骨神經",
#         "動物" : "龍,蛟,魚類,蜥蜴,蚯蚓,不帶翅膀的蟲,昆蟲類的幼蟲",
#         "靜物" : "瓷盆,瓦罐,甲胄,漁網,缸甕,錢物,頭盔,盆,皮毛,衣物,五穀,米麥,藥品,碾磨,香紙",
#         "地理" : "走廊,寺觀,溝渠,土堆,淺灘,泥濘,池塘,山包,高崗,墳墓,莊稼地,醫院,公檢司法機關",
#         "方位" : "東偏南",
#         "天時" : "龍捲風,颱風,颶風,濃雲秘密布",
#         "色彩" : "黃色",
#         "肖像" : "強時類象為個子較高,大眼,方臉,額部寬廣,面部較滿,弱時類象為臉形較小,個子中等",
#         "環境" : "為喜時類象為麥地,田園,土嶺,為忌時類象為墳墓,破花盆,泥濘之道",
#         "人物" : "為喜時類象為長男,醫生,護士,為忌時類象為尼姑,道士,僧人",
#         "人體" : "不論喜忌均可類象為骨,皮膚,脖子,喉嚨",
#         "疾病" : "糖尿病,皮膚病,骨炎,聲音嘶啞",
#         "動物" : "龍,大蛇,蚯蚓",
#         "吉凶" : "喜則醫術精明,健康,愉快,凶則表示怪聲怪氣,呻吟痛苦"
#     },     

# # 象義：主文書資訊、驚恐之事、多疑、不講道理、愛生悶氣，也主輕薄、輕浮、淫亂、私情、怪異、爭鬥、口舌、流血、變化、乞索、討債、賞賜、獎賞、聰明、狡詐、虛偽、憂愁、文藝、輕狂、謾罵、犯法。
#     "地支巳" :{
#         "show_type":"地支",
#         "index" : ["巳"],
#         "subEtc" : "[陰火]",
#         "subTitle" : "信息,驚擾,怪異,爭鬥,口舌,流血,變化,乞索,討債,賞賜,獎賞,聰明,狡詐,虛偽,憂愁,文藝,輕狂,謾罵,犯法",

#         "衝合" : "巳亥相衝,巳申相合",
#         "人物" : "精神病患者,經常做夢的人,怪人,流血受傷的人,愛打架者,討債者,文藝工作者,犯法者,虛偽狡詐者,廚師,歌手,少女,美人,乞丐,婦人",
#         "形態" : "紅腦門,大嘴,頭髮黃,眼目不整,水蛇腰,哈腰,走路搖擺",
#         "性情" : "狡猾善變,神經質,虛偽怪異,精神恍惚",
#         "人體" : "血液,心,面部,口腔,喉嚨,齒,脣,左肩小腸,眼睛,肛門",
#         "動物" : "蛇,蚓,蟬,螢火蟲,飛蟲,飛鳥,蜥蜴,鱔魚",
#         "植物" : "植物的尖部,藤蘿,瓜秧,牽牛,蒺藜,爬山虎等蔓狀類植物",
#         "靜物" : "文字,文件,文書,書畫,證件票據,磚瓦,花果,煙囪,電視機,燈,手機,電話,電器類,發熱物體,火光,煙霧,火災",
#         "地理" : "熱鬧向陽質地,娛樂場所,磚廠,化工廠,彎曲的河流,彎曲的小路,長城,電器店",
#         "方位" : "南偏東",
#         "天時" : "炎熱,星星",
#         "色彩" : "紅色",
#         "肖像" : "強時表現為個頭中等,園臉,臉色白中帶紅,眉毛特別濃黑,弱時類象為個子不高,臉橢圓,臉部較無表情,呆板",
#         "環境" : "為喜時類象為燒烤店,電器行,電影院,舞廳,為忌時類象為火葬場,廢棄的磚瓦房,濃煙滾滾的冶煉廠",
#         "人體" : "不論喜忌均可類象為三焦,小腸,牙齒,口腔,眼睛",
#         "動物" : "蛇,泥鰍,黃鱔",
#         "疾病" : "牙疼,口腔炎,近視眼,結腸炎",
#         "吉凶" : "喜則表示愛情,溫暖,熱烈,忌則表示為寒冷,失意,怯場"
#     },         

# # 象義：主文書、榮譽、證書、婚姻資訊、書籍、主驚恐災禍、又主有血光之事、為人好利祿、貪求富貴。官司、疑惑、口舌、是非、誠信、火光、詛咒、胎孕、詞訟、資訊、光彩
#     "地支午" :{
#         "show_type":"地支",
#         "index" : ["午"],
#         "subEtc" : "[陽火]",
#         "subTitle" : "驚恐,疑惑,口舌,是非,誠信,火光,文書,詛咒,胎孕,詞訟,信息,光彩",

#         "衝合" : "子午相衝,午未相合",
#         "人物" : "富商,名人,經理,第三者,善良的人,教徒,愛騎馬的人,紡織者,膽小者,驚恐者,胎孕,愛罵人者,文化人,廣告經營者,導演,演員,製片人,工礦冶煉,電業,兵工,燒傷者,燙傷者,發燒者",
#         "形態" : "目圓,面赤,身體高大",
#         "性情" : "脾氣急躁,點火就著",
#         "人體" : "心,口,目,血液,神經,小腸,頭,舌,肚臍",
#         "動物" : "馬,鹿,獐,麝,漂亮的鳥類",
#         "植物" : "花,盆景,綠籬,觀賞樹",
#         "靜物" : "電話,信息,手機,文章,電視機,書畫,旌旗,褲子,槍炮彈藥,煙花爆竹,絲綢,布料,棉麻織品,鍋爐,暖氣",
#         "地理" : "漂亮壯麗的建築物,客廳,大廳,廚房,窯燥,窗戶,電影院,山嶺,娛樂場所,電站,電子設備廠,商店,爐冶,高嶺,田園,道路,鳥窩,雞窩,鳥籠子",
#         "方位" : "正南",
#         "天時" : "閃電,太陽,炎熱",
#         "色彩" : "紅色",
#         "肖像" : "強時個子較高,蘋果臉形,雙眼皮,眼大而有神,弱時個子中等,臉不透血色,眼睛下陷",
#         "環境" : "為喜時類象為娛樂場,會議室,遊戲廳,為忌時類象為地下賭場,被火燒過的山嶺,廢棄的爐灶,門前的電壓器",
#         "人物" : "為喜時類象為高貴女人,賣酒人,女秘書,為忌時類象為火葬場焚屍工,酒鬼,七竅流血之人",
#         "人體" : "不論喜忌均可類象為舌頭,額頭,臉部,臍,神氣",
#         "疾病" : "紅眼病,胸悶,熱症,心肌梗塞",
#         "吉凶" : "吉則表示衷情,感激,凶則表示口舌,驚疑,血光之災"
#     },
     
# # 象義：口味、食味、味道、酒食、宴會、婚姻、喜慶、拜神、會見、小的收穫、否定也為毒藥、藥品。
#     "地支未" :{
#         "show_type":"地支",
#         "index" : ["未"],
#         "subEtc" : "[陰土]",
#         "subTitle" : "口味,味道,酒食,宴會,婚姻,喜慶,拜神,召見,會見,小的收穫,否定",

#         "衝合" : "丑未相衝,午未相合",
#         "人物" : "豐滿之人,胖人,喜食者,好打扮著,經營酒水者,廚師,調酒師,茶師,經營食品者,父母,老人,姑嫂,姨妹,教徒,寡婦",
#         "形態" : "肥胖,豐滿,肉多,皮膚乾燥,脣厚",
#         "性情" : "豪爽好飲,樂觀性直,知書達理",
#         "人體" : "頭,胃,肝,脊柱,右肩,腹腔,手,口舌",
#         "動物" : "海鮮,河蝦,養,鹿,驢,騾等一切能提供人們飲食的動物",
#         "植物" : "農作物,蔬菜,果樹,等一切能提供人們飲食的植物",
#         "靜物" : "盤子,碗,帽子,衣裳,印信,酒器,用最嘴的樂器,醫療器械,藥品,窗簾,食品",
#         "地理" : "院子,牆,坑,底窪處,沼澤,湖泊,監獄,動物的圈,水晶,自來水,廚房,田地,墳墓,田野,磚廠,廟宇,神祠",
#         "方位" : "南偏西",
#         "天時" : "多雲,燥熱",
#         "色彩" : "黃色",
#         "肖像" : "強時臉長,個子瘦高,不漂亮,弱時類象為臉方,個子中等,長相一般",
#         "環境" : "為喜時類象為廚房,油庫,茶房,為忌時類象為廢棄的油庫,野外燒烤用的爐灶,醫院的消毒室",
#         "人物" : "為喜時類象為放羊人,高貴的婦人,為忌時類象為尼姑,巫師,道人,牢獄之人",
#         "人體" : "不論喜忌均可類象為胃部,皮膚,頭屑,脾",
#         "動物" : "羊,鹿",
#         "疾病" : "便秘,皮膚紅腫,急性胃炎",
#         "吉凶" : "吉則安靜,享受,忌則精神頹喪,表情模糊,吃苦"
#     },
     



# # 象義：傳送之神、又主軍、警、政、法之人、又主奔波流動、又主凶惡、代表喜歡武術、刀槍棍棒之人或很喜歡現在武器等。申為忌克主道路不順，傷災車禍，喪事，路見武界之人。大車、大路、水泥路、運動、傳遞、道路、疾病、精神、意識、交易、失脫、問題、阻隔、困難。
#     "地支申" :{
#         "show_type":"地支",
#         "index" : ["申"],
#         "subEtc" : "[陽金]",
#         "subTitle" : "運動,傳遞,道路,疾病,精神,意識,交易,失脫,問題,阻隔,困難",

#         "衝合" : "申寅相衝,巳申相合",
#         "人物" : "軍人,公檢法,獵人,惡人,旅遊者,首飾加工者,冶煉者,金屬加工,汽車製造者,財務,經商,醫生,屠宰,穿孝的人",
#         "形態" : "圓臉,圓眼,脖子粗短,腦門後平,身材肥大",
#         "性情" : "嚴肅,急躁,不怒而威",
#         "人體" : "大腸,右胸,右臂,骨,肺,食道,氣管",
#         "動物" : "獅子,老虎,猴子,猿,猩猩",
#         "植物" : "大麥,堅果,榛子,核桃,慄子,松子,胡桃",
#         "靜物" : "刀,劍,武器,絹帛,經文,羽毛,藥物,金銀,鐵器,汽車,飛機,石製品,金屬製品,水泥製品",
#         "地理" : "道路,關口,路障,懸崖,湖,池,河水之發源地,靈柩,神堂,佛堂,麥地,機械場,金屬加工冶煉廠,水泥廠,首飾廠",
#         "方位" : "西偏南",
#         "天時" : "霹靂,閃電",
#         "色彩" : "白色,金色",
#         "肖像" : "強時類象為個子高,皮膚白淨,鼻梁高,沒有耳垂,弱時類象為個子中等,皮膚白中帶黑斑,山根下陷,耳朵反輪",
#         "環境" : "喜時類象為冰山,河源,珠寶店,鋼鐵廠,汽車銷售部,忌時類象為祠堂,廢棄的鋼鐵廠,報廢汽車",
#         "人物" : "為喜時類象為醫生,軍人,警察,珠寶商人,為忌時類象為暴徒,屠夫",
#         "人體" : "不論喜忌均可類象為,胸,肺,筋骨,大腸",
#         "動物" : "猿,猴",
#         "吉凶" : "為吉時神佛仳佑,逢凶化吉,為忌時則惹神撞鬼,出行不吉",
#         "疾病" : "肺結核,急性肺炎,骨折,四肢不靈"
#     },
     
# # 象義：主面板、四肢、論女人沉靜高雅、見水主放蕩、淫亂、輕浮(水有制不淫)、金水相逢又見土素質高、做事詭祕。密謀、籌劃、策劃、縝密、精緻、細節、完美、金融、經濟、市場、交易、買賣
#     "地支酉" :{
#         "show_type":"地支",
#         "index" : ["酉"],
#         "subEtc" : "[陰金]",
#         "subTitle" : "密謀,籌劃,策劃,縝密,精緻,細節,完美,金融,經濟,市場,交易,買賣",

#         "衝合" : "卯酉相衝,辰酉相合",
#         "人物" : "經商人,策劃人,總經理,細緻完美的人,資助自己的異性朋友,女人,女友,第三者,戴金銀首飾的人,歌星,律師,教師,從事說教工作的人,金融工作者,經紀人,銀行工作者,刀傷的人",
#         "形態" : "形貌端莊,面色黃白,聲音清脆圓潤",
#         "性情" : "文靜,文雅,談吐不凡,細膩認真",
#         "人體" : "右肋,手臂,口,耳,目,嘴,鼻,肛門,尿道,陰道,手,骨骼,經血,小腸",
#         "動物" : "雞,鴿,鴨,鵝,羊,善鳴叫的鳥類",
#         "植物" : "蔥,姜,辣椒,大蒜,小麥,辛辣植物",
#         "靜物" : "金銀,首飾,皮革,玻璃製品,金屬製品,玉石製品,鏡子,玻璃,寶劍,小刀,手術刀,錢幣,信用卡,珠寶,首飾,洗衣機,瓜果,口罩,石柱,石碑,酒製品,菜食",
#         "地理" : "門,窗,路,停車場,平坦之地,跑道,光滑之地,酒店,房子,車子,樂器",
#         "方位" : "西",
#         "天時" : "霜,雪",
#         "色彩" : "白",
#         "肖像" : "強時類象為橢圓形臉,明亮的杏眼,皮膚細白,個頭適中,弱時類象為瓜子臉,個子矮小,皮膚粗糙",
#         "環境" : "為喜時類象為機廠,停機坪,汽車站,修理廠,五金店,化裝室,為忌時類象為停屍房,手術室,爆炸現場,打靶場",
#         "人體" : "不論喜忌均可類象為膽,胸,尾椎,毛髮等",
#         "疾病" : "四肢傷殘,肝病,膽病",
#         "吉凶" : "喜則類象為得財,好信息,凶則類象為疾病,口舌,破財"
#     },
     
# # 象義：佛學用品、主惡人、黑社會、執法者、欺詐、虛偽、虛耗、虛假、思考、空虛、偽裝、虛幻、縹緲、茫然、不切合實際、深邃、精神、宗教、詐騙-引申意為表面上好，實際上比誰都壞。
#     "地支戌" :{
#         "show_type":"地支",
#         "index" : ["戌"],
#         "subEtc" : "[陽土]",
#         "subTitle" : "欺詐,虛偽,虛耗,虛假,思考,空虛,偽裝,虛幻,飄渺,茫然,不切合實際,深邃,精神,宗教",

#         "衝合" : "辰戌相衝,卯戌相合",
#         "人物" : "軍人,獄警,門衛,長者,教徒,獵人,惡人,黑社會,強盜,乞丐,善人,小孩,舅舅,妹妹,建築者",
#         "形態" : "方臉,眼泡大,嘴脣厚,手掌鬆軟,皮膚乾燥",
#         "性情" : "慈祥,寬厚,態度安然",
#         "人體" : "命門,膀胱,腿足,腹部,胃,脾,臀,胸",
#         "動物" : "狗,豺,狼,鷹,大雁",
#         "植物" : "紅柳,甘草,枸杞,棗樹,仙人掌,地黃等沙漠或抗旱的植物",
#         "靜物" : "服裝,鞋履,刀劍,手銬,刑具,農具,鑰匙,鎖頭,碾磨,瓦器,石塊,出土文物,佛珠,罈子,堅硬之物,乾燥之物,爐子,燥,變壓器,瓷器,鎖,藥箱,鑰匙,屍骨",
#         "地理" : "高崗,高坡,山嶺,寺觀,學校,牢獄,冶煉廠,化工廠,堂屋,墳墓,牆垣",
#         "方位" : "西偏北",
#         "天時" : "雲,陰天",
#         "色彩" : "黃色",
#         "肖像" : "強時類象為大臉,個子高,鼻梁直,弱時類象為個子不高,臉呈橢圓形,勾鼻",
#         "環境" : "為喜時類象為花果山,廚房,磚瓦廠,變電所,為忌時類象為,墳墓,彈藥庫,牢房,廁所",
#         "人物" : "吉時為農民,清潔工,好人,佛教徒,風水先生,為忌時類象孤寒之人,盜墓者,獄吏,丑婦",
#         "動物" : "狗,熊",
#         "人體" : "不論喜忌均可類象為命門,膝,腕,鼻子,皮膚等",
#         "疾病" : "胃出血,鼻炎,關節炎,皮膚搔癢",
#         "吉凶" : "吉則辦事順利,心情舒暢,凶則牢獄之災,心情壓抑"
#     },
    
# # 象義：賞賜、旺相有制主人善良。亥主妄想，坐那什麼也不想幹，也不知在想什麼。有“海”的意思。亥為忌生主家人有怪異附身，有病人、驚訝、膽怯、流動、光明、召見、隱私、髒髒、偷盜、目眩、恍惚、困難、疑惑、爭鬥、沉溺、索取。
#     "地支亥" :{
#         "show_type":"地支",
#         "index" : ["亥"],
#         "subEtc" : "[陰水]",
#         "subTitle" : "驚訝,膽怯,流動,光明,召見,隱私,骯髒,偷盜,眩暈,恍惚,困難,疑惑,爭鬥,沉溺,索取",

#         "衝合" : "巳亥相衝,寅亥相合",
#         "人物" : "兒童,軍人,酗酒人,乞丐,藝人,盜賊,產銷飲品者,風流淫蕩之人,下流之人,陰謀之人,哭泣之人,腹瀉之人",
#         "形態" : "長臉,黑面,手腳也黑,大頭",
#         "性情" : "精神恍惚,神經衰弱,聰明伶俐,風流淫蕩",
#         "人體" : "眼,頭髮,毛髮,腎,膀胱,陰道,血液,體液,分泌物,肛門,腳",
#         "動物" : "豬,熊,魚蝦等水中生長的動物",
#         "植物" : "梅花,葫蘆,水草,海帶,荷花,水稻,菱角,蘆葦等水中生長的植物",
#         "靜物" : "筆墨,布匹,毛皮,帳子,麻布,圖畫,幔帳,傘,雨具,斗笠,圓環,醬油,醋,糖,鹽,飲料",
#         "地理" : "庭院,菜園,牆角,低窪地,江河,湖海,倉庫,寺院,樓台,飲料,酒廠,鹽場,醬油廠,浴場等",
#         "方位" : "北偏西",
#         "天時" : "雲,陰天,陰雨",
#         "色彩" : "黑色,藍色",
#         "肖像" : "強時類象為臉長,個子中等,臉黑,耳朵較長,弱時類象為個子矮小,臉白,耳朵較小",
#         "環境" : "為喜時為小溪,泉水,小湖泊,天池,為忌時為下水道,臭水溝,污水坑,廁所",
#         "人物" : "吉時為少女,船工,自來水公司職員,忌時為乞丐,犯人,捕魚人",
#         "人體" : "不論喜忌均可類象為膀胱,陰道,肛門,分秘物,頭顱",
#         "動物" : "豬",
#         "疾病" : "血病,月經不調,早泄,遺精,盜汗,洛血,小便赤熱",
#         "吉凶" : "喜則婚姻美滿,凶則家庭破裂,凶事不斷"
#     }

# }




# eightDoor_dict = {

#     "休門":{
#         "show_type":"八門",               # type
#         "index" : [ "休門" ],
#         "subTitle" : "戀愛,婚姻家庭,休閒愉悅,休息,休止,謁貴",
#         "subEtc" : "[水]",  # 右邊補充

#         "象意" : "休閒方面的物品,床,躺椅,沙發,涼亭等,休門屬水,也表示有關於水的物品",
#         "人物" : "性格閒散,懶散,輕鬆和諧,不積極,無鬥志,離職退休者,戀人,貴人",
#         "風水象徵" : "江河湖水池,有水的漥地,酒吧,飲料店",
#         "門迫" : "休門五行屬水,落離宮形成水剋火的格局,主消極無所事事,停頓,瓶頸",
#         "入墓" : "巽四宮,謀事阻滯不通,吉神入墓不吉,凶神入墓不兇",
#         "補充" : "休門也為吉門,利於求見領導和貴人,上官赴任,嫁娶遷徙,經商建造,但不利行刑斷獄"
#     },


# }




# nineStar_dict = {
#     "天蓬" : {
#         "show_type":"九星",               # type
#         "index" : [ "天蓬星" ],
#         "subTitle" : "又名貪狼星,位居坎宮,屬一白,為陽星,代表黑社會,殺人犯,重大搶劫盜竊犯罪之人,重大貪污犯,貪圖酒色之人,大眼睛之人,高智商犯罪人員,流動性強,陰險,狡詐之人等",
#         "subEtc":"[水]",   # 右邊補充

#         "概念":"智商——思考力,膨脹鼓起,蓬鬆,四面透風的,鬆軟的,洶湧澎湃,聰明智慧",

#         "形態":"莊嚴,威猛,彪悍,精幹,面黑或眼大",

#         "性情":"圓融果敢,膽大妄為,心狠手辣,貪戀酒色",

#         "人體":"耳,腎,膀胱",

#         "動物":"豬,鼠,蝙蝠",

#         "人物":"多毛之人,頭髮蓬鬆之人,威猛彪悍之人聰明智慧之人",

#         "植物":"蘑菇類,菌類植物,樹冠大的樹",

#         "地理":"冠狀大樹,篷子,帳篷,崗樓,樓房,戴尖頂的房屋,帶角的物體",

#         "靜物":"傘,雨衣,雨具,寬鬆的衣服",

#         "方位":"北方",

#         "天時":"冬天",

#         "色彩":"黑色,藍色,玄色"
#     },

    
# }