# 1924_>2028
# https://www.cmoney.tw/notes/note-detail.aspx?nid=66991



yearSubData_dict =[
		{
			'animal': '鼠',
			'match': '甲子',
			'year': '1924、1984',
			'type': '金',
			'detail': '五行屬海中金，屋上之鼠。甲子年出生的人，學業上不會有多大的成就，做事往往會有始無終，男人妻大，女人夫長，女人十分伶俐聰明，乃是賢能之命。'
		}, 

		{
			'animal': '鼠',
			'match': '丙子',
			'year': '1936、1996',
			'type': '水',
			'detail': '五行屬澗下水，田內之鼠。丙子年出生的人，膽量較大，有權柄和謀略，早年平平，中年成就晚景大好。女人大多有饒舌絮聒之命，一定要控制言行，因為言多必失，應安分守己才可。'
		}, 

		{
			'animal': '鼠',
			'match': '戊子',
			'year': '1948、2008',
			'type': '',
			'detail': '五行屬霹雷火，倉內之鼠。為人計算聰明，精通文武，早生兒女客，遲生保平安，夫妻和順，有財帛之命，晚年大興旺相，女人賢良，具發達之命。'
		}, 

		{
			'animal': '鼠',
			'match': '庚子',
			'year': '1960、2020',
			'type': '土',
			'detail': '五行屬壁上土，樑上之鼠。為人尊重安穩，一生衣祿無虧，持家有權柄，遇事逢凶化吉，有貴人提拔，女人具興旺相家之命。'
		}, 

		{
			'animal': '鼠',
			'match': '壬子',
			'year': '1912、1972',
			'type': '木',
			'detail': '五行屬桑松木，山上之鼠。為人幼年有災，中年已是租用，男招好妻，身閒心苦，多喜多憂，兄弟少力，六親冷淡，凡事自做自為，女具賢能之命。'
		}, 

		{
			'animal': '牛',
			'match': '乙丑',
			'year': '1925、1985',
			'type': '金',
			'detail': '五行屬海中金，海內之牛。乙丑年出生的人，非常得慷慨大方，喜愛春風，見事則多學少成，幼災父母，九流中人，夫妻無刑，兒女不孤，六親少靠，乃是賢良、純和之命。'
		}, 

		{
			'animal': '牛',
			'match': '丁丑',
			'year': '1937、1997',
			'type': '水',
			'detail': '五行屬澗下水，湖內之牛。丁丑年出生的人，為人和氣，一生都衣祿無憂，初年財祿常在，晚景有乘骨肉，頭見女吉，遲生則好。夫妻和順，女人往往會旺夫，具有持家賢良之命。'
		}, 

		{
			'animal': '牛',
			'match': '己丑',
			'year': '1949、2009',
			'type': '火',
			'detail': '五行屬霹雷火，欄內之牛。為人口快心直，通文藝，有才能，衣祿不少，男再娶，而女再婚，均在有花燭重明之嫌。後來夫妻和順，百年偕老，具晚年發福之命。'
		}, 

		{
			'animal': '牛',
			'match': '辛丑',
			'year': '1961、2021',
			'type': '土',
			'detail': '五行屬壁上土，路途之牛。為人心性溫和，初年有驚恐之厄，雖有衣祿財帛，進退骨肉少力，晚景福壽綿長，女具血財旺相之命。'
		}, 

		{
			'animal': '牛',
			'match': '癸丑',
			'year': '1913、1973',
			'type': '木',
			'detail': '五行屬桑松木，欄外之牛。為人衣祿不少，財帛早年不聚，一生尊重，不惹是非，父母難依，骨肉少靠，夫妻和順，兒子見遲，女宜過房之命。'
		}, 

		{
			'animal': '虎',
			'match': '丙寅',
			'year': '1926、1986',
			'type': '火',
			'detail': '五行屬爐中火，山林之虎。丙寅年出生的人，往往多學少成，心性不容易不定，口硬心軟，身閒心直，手足不停，利官近貴，女人乃是賢良聰慧之命。'
		}, 

		{
			'animal': '虎',
			'match': '戊寅',
			'year': '1938、1998',
			'type': '土',
			'detail': '五行屬城頭土，過山之虎。戊寅年出生的人，為人猛烈，性格喜怒無常，反目無情，早年十分勤儉，離祖發達，聰明伶俐，守其和平，懂得以禮待人，晚年會有良機降臨，主有幸福之命。'
		}, 

		{
			'animal': '虎',
			'match': '壬寅',
			'year': '1962、2022',
			'type': '金',
			'detail': '五行屬金泊金，過林之虎。為人口快心直，有時不藏，男女早婚不宜，夫妻刑克，兒女見遲，初年做事顛倒，中年晚年財帛足用，女人持家，牲畜興旺，具晚年發福之命。'
		}, 

		{
			'animal': '虎',
			'match': '甲寅',
			'year': '1914、1974',
			'type': '水',
			'detail': '五行屬大溪水，立定之虎。為人誠實，一生利官近貴，家道興寧，衣食足用，財帛多聚，父母有刑，男人怕妻，女人管夫，命硬三分，切忌過剛。'
		}, 

		{
			'animal': '虎',
			'match': '庚寅',
			'year': '1950、2010',
			'type': '木',
			'detail': '五行屬松柏木，出山之虎。為人心性急，有口無心，易好易怒，反覆無常，衣食豐足，但財物早年耗散不聚，晚景豐隆，女人有內助旺相之命。'
		}, 

		{
			'animal': '兔',
			'match': '丁卯',
			'year': '1927、1987',
			'type': '火',
			'detail': '五行屬爐中火，望月之兔。丁卯年出生的人，為人手足不停，身心不閒，一生衣祿不缺，性情乖巧，聰明懂事，但做事卻經常有始無終，男人是有福之命，女人則天生稟性喜靜，一生安然有幸。'
		}, 

		{
			'animal': '兔',
			'match': '己卯',
			'year': '1939、1999',
			'type': '土',
			'detail': '五行屬城頭土，山林之兔。己卯年出生的人，一生衣祿充盈，自然逸閒，不受人歡，六親冷淡，骨肉難為，妻娶年長，配偶和合，女人與鄰相處較和睦，乃賢達長壽之命。'
		}, 

		{
			'animal': '兔',
			'match': '辛卯',
			'year': '1951、2011',
			'type': '',
			'detail': '五行屬松柏木，蟾窟之兔。為人心直口快，有志氣權柄，利官近貴，身閒心不閒，六親少靠，自立成家，少年勞碌，晚年大利，女人有操持家庭興隆之命。'
		}, 

		{
			'animal': '兔',
			'match': '癸卯',
			'year': '1963、2023',
			'type': '',
			'detail': '五行屬金泊金，山林之兔。為人酒食不少，福祿有餘，凶中化吉，早年財帛不聚，多收多支，晚景興隆，女人中年及晚年具只有犧牲利益，方能保持之命。'
		}, 

		{
			'animal': '兔',
			'match': '乙卯',
			'year': '1915、1975',
			'type': '水',
			'detail': '五行屬大溪水，得道之兔。為人志氣軒昂，計謀巧妙，一生近貴則百事如意，文武皆通，女人福壽無虧。'
		}, 

		{
			'animal': '龍',
			'match': '戊辰',
			'year': '1928、1988',
			'type': '木',
			'detail': '五行屬大林木，清溫之龍。戊辰年出生的人，喜愛春風，往往可壓倒眾人，利官近貴，骨肉刑傷，兒女不孤，女人大都溫良賢達，略顯嘮叨，但心事極好，主招好夫之命。'
		}, 

		{
			'animal': '龍',
			'match': '庚辰',
			'year': '1940、2000',
			'type': '',
			'detail': '五行屬白臘金，恕性之龍。庚辰年出生的人，為人性格和氣，勞碌一生，得官近貴，名利雙全，衣食足用，中年十分平順，晚年則會大興，女人大都具有勤儉操持之命。'
		}, 

		{
			'animal': '龍',
			'match': '壬辰',
			'year': '1952、2012',
			'type': '水',
			'detail': '五行屬長流，行雨之龍。為人勞碌，手足無停時，早年難守，財來財去，不聚財寶，有虛無實，晚景發財發福女有操持旺財之命。'
		}, 

		{
			'animal': '龍',
			'match': '甲辰',
			'year': '1964、2024',
			'type': '火',
			'detail': '五行屬覆燈火，伏潭之龍。為人衣食豐足，一生清閒，早年平平，中年豐厚有餘，骨肉六親難靠，對自己所想事業經營，甘年間可以發達。'
		}, 

		{
			'animal': '龍',
			'match': '丙辰',
			'year': '1916、1976',
			'type': '土',
			'detail': '五行屬沙中土，天上之龍。為人聰明伶俐，四海春見，一生衣祿無窮，身閒心勞，好交朋友，中年事業興隆，晚景財旺，女具賢能命。'
		}, 

		{
			'animal': '蛇',
			'match': '己巳',
			'year': '1929、1989',
			'type': '木',
			'detail': '五行屬大林木，福氣之蛇。己巳年出生的人，聰明伶俐，有功名之分，夫妻相處和諧，感情良好，做事如意，男人大多喜歡出風頭，做事善有計謀，英敏之才，乃是福厚之命，女人則一生衣食無憂，待人真誠。'
		}, 

		{
			'animal': '蛇',
			'match': '辛巳',
			'year': '1941、2001',
			'type': '金',
			'detail': '五行屬白臘金，冬藏之蛇。辛巳年出生的人，為人十分有計謀，遇事能隨機應變，可成大事，一生衣食足用，命中會有貴人扶助，中年和順，老年則運財發福大，乃有長壽之命。'
		}, 

		{
			'animal': '蛇',
			'match': '癸巳',
			'year': '1953、2013',
			'type': '水',
			'detail': '五行屬長流水，草中之蛇為人聰明伶俐，財谷聚而復散，主近貴人，中年風霜，具晚景榮華賢良之命，女人具興旺相家之命。'
		}, 

		{
			'animal': '蛇',
			'match': '乙巳',
			'year': '1965、2025',
			'type': '火',
			'detail': '五行屬覆燈火，出洞之蛇。為人氣象端正，且喜好春風，只是命帶指背煞，為善不彰，救人無功，做功不得好，早年子婦刑克，晚得安寧，女人有發達，相夫益子之命。'
		}, 

		{
			'animal': '蛇',
			'match': '丁己',
			'year': '1917、1977',
			'type': '土',
			'detail': '五行屬沙中土，溏內之蛇。為人利官近貴，稟性剛強不順人情，兄弟情長，事業顯榮，女人容貌美麗，衣食不足，有賢達起家之命。'
		}, 

		{
			'animal': '馬',
			'match': '庚午',
			'year': '1930、1990',
			'type': '土',
			'detail': '五行屬路傍土，堂里之馬。庚午年出生的人，沒有城府，心直口快，利官近貴，一生衣祿豐盈，男人權柄傳家，性性較固執，是受人敬佩之命。女人則榮夫益子，有秀氣之命格。'
		}, 

		{
			'animal': '馬',
			'match': '壬午',
			'year': '1942、2002',
			'type': '木',
			'detail': '五行屬楊柳木，軍中之馬。壬午年出生的人，生活勤儉，父母刑傷，災厄可折，早年即使有財，也難以積聚，晚景尚可，但一定要注意積蓄，以防旱乏，女人大都有興家賢能之命。'
		}, 

		{
			'animal': '馬',
			'match': '甲午',
			'year': '1954、2014',
			'type': '金',
			'detail': '五行屬沙中金，雲中之馬。為人和氣，喜好春風，交朋結友，利官近貴，遇凶不為凶，可逢凶化吉，骨肉少靠，女人口快能言，多出風頭。'
		}, 

		{
			'animal': '馬',
			'match': '乙午',
			'year': '1955、2015',
			'type': '金',
			'detail': '五行屬沙中金，敬重之羊。為人容貌端莊，少年勤於從事，初年平順，兄弟少靠，子息不孤，立家興隆，晚年大有財聚，女人有持家相夫益子之命。'
		}, 

		{
			'animal': '馬',
			'match': '丙午',
			'year': '1966、2026',
			'type': '水',
			'detail': '五行屬天河水，行路之馬。為人清閒，初處財帛耗散，宜作手藝功夫生意，不力求名，兄弟各自成家，後運發財興旺，女人又清奇巧妙之命。'
		}, 

		{
			'animal': '馬',
			'match': '戊午',
			'year': '1918、1978',
			'type': '火',
			'detail': '五行屬天上火，廄內之馬。為人志高氣寬，一生衣祿自然，容貌端正，性格溫良，少年多災，骨肉有刑，女人姐妹少靠，由相夫興旺之命。'
		}, 

		{
			'animal': '羊',
			'match': '辛未',
			'year': '1931、1991',
			'type': '土',
			'detail': '五行屬路傍土，得祿之羊。辛未年出生的人，非常有志氣，性格寬厚，少年多災，頭見女吉，生男有刑，夫妻和順，女人懂得持家之道，促進家業興旺，男人則有建家立業，名顯富貴之命。'
		}, 

		{
			'animal': '羊',
			'match': '癸未',
			'year': '1943、2003',
			'type': '木',
			'detail': '五行屬楊柳木，群內之羊。癸未年出生的人，心直口快，辦事俐落，雖善救人且不求回報，但卻往往因此而招惹是非，最好莫管他人之事，有財無為，財來財會，應重物質，造基礎。女人大都是賢德之人，善於持家，萬年平安。'
		}, 

		{
			'animal': '羊',
			'match': '丁未',
			'year': '1967、2027',
			'type': '水',
			'detail': '五行屬天河水，失群之羊。為人喜怒不常，一生口舌靈便，名利有分，衣祿尚足，骨肉疏遠，子息見遲，女人晚景興旺，有助夫益子之命。'
		}, 

		{
			'animal': '羊',
			'match': '己未',
			'year': '1919、1979',
			'type': '火',
			'detail': '五行屬天上火，草野之羊。為人口快舌硬，衣祿自來，前程賢達，得貴人所欽敬，則財款相旺，百事榮昌，強公勝祖，朋友尊重，乃旺相之命。'
		}, 

		{
			'animal': '申',
			'match': '壬申',
			'year': '1932、1992',
			'type': '金',
			'detail': '五行屬劍鋒金，清秀之猴。壬申年出生的人，聰明性巧，有機謀但善變，和氣春風，功名有分，男人招賢德之妻，姿性英敏，多受不愛，女人則大多相貌艷麗，具有富貴之命。'
		}, 

		{
			'animal': '申',
			'match': '甲申',
			'year': '1944、2004',
			'type': '水',
			'detail': '五行屬井泉水，過樹之猴。為人衣祿不少，心性溫柔，出入壓眾，初年顛倒，晚年利達，邢家豐隆，夫妻和順，兒女見遲，女人操持興旺，有榮祿之命。'
		}, 

		{
			'animal': '申',
			'match': '丙申',
			'year': '1956、2016',
			'type': '火',
			'detail': '五行屬山下火，山上之猴。為人衣食足用，交易買賣，利路亨通，生財有道，牛田有分，早年勞碌，晚景興旺，女人具持家旺相發達之命。'
		}, 

		{
			'animal': '申',
			'match': '戊申',
			'year': '1968、2028',
			'type': '土',
			'detail': '五行屬大澤土，獨立之猴。為人性急，做事反覆，一生勞碌辛苦，利官見貴，兒女刑傷，財帛足用，女人賢良曉事，具子息不孤之命。'
		}, 

		{
			'animal': '申',
			'match': '庚申',
			'year': '1920、1980',
			'type': '木',
			'detail': '五行屬石榴木，食果之猴。為人一生手足不停，名行清高，利官近貴，明礬指背煞，做好不得好，救人無功勞，立志姓賈，六親冷淡，女具晚景興隆之命。'
		}, 

		{
			'animal': '雞',
			'match': '癸酉',
			'year': '1933、1993',
			'type': '金',
			'detail': '五行屬劍鋒金，樓宿之雞。癸酉年出生的人，心直口快，為人公正，處事公平，一生口便去利，命藏衣祿，平穩足用，六親冷淡，為人平和，不貪不取，晚景時會時運興旺，女人大都有旺夫興家立世之命。'
		}, 

		{
			'animal': '雞',
			'match': '乙酉',
			'year': '1945、2005',
			'type': '水',
			'detail': '五行屬井泉水，午唱之雞。為人心直口快，志氣軒昂，衣祿足用，福壽雙全，兄弟雖有，難為得利，六辛和睦，女人興財綿遠，平穩之命。'
		}, 

		{
			'animal': '雞',
			'match': '丁酉',
			'year': '1957、2017',
			'type': '火',
			'detail': '五行屬山下火，獨立之雞。為人好春風，多情重恩，利官近貴，除年勞碌，身閒心苦，晚景家道興隆，女人具清秀命格，伴夫伴財，老歲吉昌。'
		}, 

		{
			'animal': '雞',
			'match': '己酉',
			'year': '1909、1969',
			'type': '土',
			'detail': '五行屬大澤土，報效之雞。為人心性聰明，衣祿有足，六親難靠，兒女早見，做事如意，百事皆通，凡事寬量，女人計較多變，無災厄之命。'
		}, 

		{
			'animal': '雞',
			'match': '辛酉',
			'year': '1921、1981',
			'type': '木',
			'detail': '五行屬石榴木，籠藏之雞。為人一生伶俐，精神清爽，口舌能辯，高人敬重，財帛足用，六親冷淡，骨肉情疏，女人賢德，有操持興家之命。'
		}, 

		{
			'animal': '狗',
			'match': '甲戌',
			'year': '1934、1994',
			'type': '火',
			'detail': '五行屬山頭火，守身之狗。甲戌年出生的人，心直口快，經常處於忙碌之中，不權柄智謀，名聲遠播，福祿有餘。女人大都有旺夫和生財之命。'
		}, 

		{
			'animal': '狗',
			'match': '丙戌',
			'year': '1946、2006',
			'type': '土',
			'detail': '五行屬屋上土，自眠為狗。為人豪傑和順，招財得寶，自立家業，前運辛勞，晚年榮華，女人具血財旺相之命。'
		}, 

		{
			'animal': '狗',
			'match': '戊戌',
			'year': '1958、2018',
			'type': '木',
			'detail': '五行屬平地木，進山之狗。為人和氣，自營自立，早年顛倒，財谷耗散，晚景得財，宜拜師學藝術，方能業立而成功，財源廣進，利路亨通，女人具養育中平之命。'
		}, 

		{
			'animal': '狗',
			'match': '庚戌',
			'year': '1910、1970',
			'type': '金',
			'detail': '五行屬釵釧金，寺觀之狗。為人快活，丑年有災，利官近貴，做事敏捷，百事如意，勤儉勵業，福在晚年，只是犯之被殺，救人無功，女舉賢能興旺之命。'
		}, 

		{
			'animal': '狗',
			'match': '壬戌',
			'year': '1922、1982',
			'type': '水',
			'detail': '五行屬大海水，顧家之犬。為人一生好行善事，東來西去不住不停，多勞多管，衣食不缺，貴人提拔，謀事稱意，早年平常，晚年興旺，女性善良，具賢良之命。'
		}, 

		{
			'animal': '豬',
			'match': '乙亥',
			'year': '1935、1995',
			'type': '火',
			'detail': '五行屬山頭火，過往之豬。乙亥年出生的人，性格溫順，然幼年多災，父母有刑，但並無大害，夫婦和順，可攜手到老，存心中正，中年末歲會財谷興旺，於女有克，應以見遲為好。'
		}, 

		{
			'animal': '豬',
			'match': '丁亥',
			'year': '1947、2007',
			'type': '土',
			'detail': '五行屬屋上土，過山之豬。為人性巧聰明，自立自營，兒女有刑，見運方好，生平好做善事，財源旺相，女人衣祿平穩，主有天才之命。'
		}, 

		{
			'animal': '豬',
			'match': '己亥',
			'year': '1959、2019',
			'type': '木',
			'detail': '五行屬平地木，道院之豬。為人巧計伶俐，衣食安穩，骨肉少力，六親冷淡，而女早見刑克，夫妻和順，女人清閒，具晚年發達之命。'
		}, 

		{
			'animal': '豬',
			'match': '辛亥',
			'year': '1911、1971',
			'type': '金',
			'detail': '五行屬釵釧金，圈養之豬。為人不惹閒事，百事謀求皆順，但早年不聚財物，晚景多遇良機，可謂榮華富貴之命。女人具發福立業之命。'
		}, 

		{
			'animal': '豬',
			'match': '癸亥',
			'year': '1923、1983',
			'type': '水',
			'detail': '五行屬大海水，林下之豬。為人剛直，不順人情，財谷不缺，六親疏遠，自立權衡則晚景勝前，乃興家創業之命。女人持家，牲畜興旺，具福壽綿長之命。'

		}
]




def getDictData( matchName ):
	for each in yearSubData_dict:
		if each["match"] == matchName:
			animal_buf = each["animal"]	  ## 'animal': '豬',
			year_buf = str(each["year"])  ## 'year': '1923、1983',
			type_buf = each["type"]	      ## 'type': '水',
			detail_buf = each["detail"]	  ## 'detail': '五行屬大海水，林下之豬。為人剛直，不順人情，財谷不缺，六親疏遠，自立權衡則晚景勝前，乃興家創業之命。女人持家，牲畜興旺，具福壽綿長之命。'

			# print( animal_buf,year_buf,type_buf,detail_buf )
			return [type_buf,detail_buf]


	
	# for each in yearSubData_dict:	
	# 	year = len(str(each["year"]))
	# 	print ( each["match"],each["year"] )




if __name__ == '__main__':
	getDictData( "辛亥")





# 		each["year"] = str( int(each["year"])-60 ) + "、" + str(each["year"])

# print( dict )










# [
# { 
# "name":"乾",
# "nickname":"天",
# "type":"金",
# "item":[ 1,1,1,1,1,1 ], #由下往上
# "out":"乾", # 外卦為上卦
# "in":"乾",  # 內卦為下卦
# "number":1,
# "aka":"困龍得水"
# },

# { 
# "name":"坤",
# "nickname":"地",
# "type":"土",
# "item":[ 0,0,0,0,0,0 ], #由下往上
# "out":"坤", # 外卦為上卦
# "in":"坤",  # 內卦為下卦
# "number":2,
# "aka":"餓虎得食"
# },

# { 
# "name":"水雷",
# "nickname":"屯",
# "type":"水",
# "item":[ 1,0,0,0,1,0 ], #由下往上
# "out":"坎", # 外卦為上卦
# "in":"震",  # 內卦為下卦
# "number":3,
# "aka":"亂絲無頭"
# },

# { 
# "name":"山水",
# "nickname":"蒙",
# "type":"火",
# "item":[ 0,1,0,0,0,1 ], #由下往上
# "out":"艮", # 外卦為上卦
# "in":"坎",  # 內卦為下卦
# "number":4,
# "aka":"小鬼偷錢"
# },

# { 
# "name":"水天",
# "nickname":"需",
# "type":"土",
# "item":[ 1,1,1,0,1,0 ], #由下往上
# "out":"坎", # 外卦為上卦
# "in":"乾",  # 內卦為下卦
# "number":5,
# "aka":"明珠出土"
# },

# { 
# "name":"天水",
# "nickname":"訟",
# "type":"火",
# "item":[ 0,1,0,1,1,1 ], #由下往上
# "out":"乾", # 外卦為上卦
# "in":"坎",  # 內卦為下卦
# "number":6,
# "aka":"二人爭路"
# },

# { 
# "name":"地水",
# "nickname":"師",
# "type":"水",
# "item":[ 0,1,0,0,0,0 ], #由下往上
# "out":"坤", # 外卦為上卦
# "in":"坎",  # 內卦為下卦
# "number":7,
# "aka":"馬到成功"
# },

# { 
# "name":"水地",
# "nickname":"比",
# "type":"土",
# "item":[ 0,0,0,0,1,0 ], #由下往上
# "out":"坎", # 外卦為上卦
# "in":"坤",  # 內卦為下卦
# "number":8,
# "aka":"船得順風"
# },


# { 
# "name":"風天",
# "nickname":"小畜",
# "type":"木",
# "item":[ 1,1,1,0,1,1 ], #由下往上
# "out":"巽", # 外卦為上卦
# "in":"乾",  # 內卦為下卦
# "number":9,
# "aka":"密雲不雨"
# },


# { 
# "name":"天澤",
# "nickname":"履",
# "type":"土",
# "item":[ 1,1,0,1,1,1 ], #由下往上
# "out":"乾", # 外卦為上卦
# "in":"兌",  # 內卦為下卦
# "number":10,
# "aka":"履虎尾不咥人"
# },

# { 
# "name":"地天",
# "nickname":"泰",
# "type":"土",
# "item":[ 1,1,1,0,0,0 ], #由下往上
# "out":"坤", # 外卦為上卦
# "in":"乾",  # 內卦為下卦
# "number":11,
# "aka":"喜報三元"
# },


# { 
# "name":"天地",
# "nickname":"否",
# "type":"金",
# "item":[ 0,0,0,1,1,1 ], #由下往上
# "out":"乾", # 外卦為上卦
# "in":"坤",  # 內卦為下卦
# "number":12,
# "aka":"虎落陷坑"
# },


# { 
# "name":"天火",
# "nickname":"同人",
# "type":"火",
# "item":[ 1,0,1,1,1,1 ], #由下往上
# "out":"乾", # 外卦為上卦
# "in":"離",  # 內卦為下卦
# "number":13,
# "aka":"仙人指路"
# },

# { 
# "name":"火天",
# "nickname":"大有",
# "type":"金",
# "item":[ 1,1,1,1,0,1 ], #由下往上
# "out":"離", # 外卦為上卦
# "in":"乾",  # 內卦為下卦
# "number":14,
# "aka":"砍樹摸雀"
# },

# { 
# "name":"地山",
# "nickname":"謙",
# "type":"金",
# "item":[ 1,0,1,1,1,1 ], #由下往上
# "out":"坤", # 外卦為上卦
# "in":"艮",  # 內卦為下卦
# "number":15,
# "aka":"二人分金"
# },

# { 
# "name":"雷地",
# "nickname":"豫",
# "type":"木",
# "item":[ 0,0,0,1,0,0 ], #由下往上
# "out":"震", # 外卦為上卦
# "in":"坤",  # 內卦為下卦
# "number":16,
# "aka":"青龍得應"
# },

# { 
# "name":"澤雷",
# "nickname":"隨",
# "type":"木",
# "item":[ 1,0,0,1,1,0 ], #由下往上
# "out":"兌", # 外卦為上卦
# "in":"震",  # 內卦為下卦
# "number":17,
# "aka":"推手靠岸"
# },

# { 
# "name":"山風",
# "nickname":"蠱",
# "type":"木",
# "item":[ 0,1,1,0,0,1 ], #由下往上
# "out":"艮", # 外卦為上卦
# "in":"巽",  # 內卦為下卦
# "number":18,
# "aka":"推磨岔道"
# },

# { 
# "name":"地澤",
# "nickname":"臨",
# "type":"木",
# "item":[ 0,1,1,0,0,1 ], #由下往上
# "out":"坤", # 外卦為上卦
# "in":"兌",  # 內卦為下卦
# "number":19,
# "aka":"發政施人"
# },


# { 
# "name":"風地",
# "nickname":"觀",
# "type":"金",
# "item":[ 0,0,0,0,1,1 ], #由下往上
# "out":"巽", # 外卦為上卦
# "in":"坤",  # 內卦為下卦
# "number":20,
# "aka":"鸛鵲同林"
# },











